package javacorehw03.main;

// 1. Создать программу управления банковским счетом (Account).

// Программа должна позволять пользователю вводить начальный баланс счета, сумму депозита и сумму снятия средств. 
// При этом она должна обрабатывать следующие исключительные ситуации:

// Попытка создать счет с отрицательным начальным балансом должна вызывать исключение IllegalArgumentException с соответствующим сообщением.
// Попытка внести депозит с отрицательной суммой должна вызывать исключение IllegalArgumentException с соответствующим сообщением.
// Попытка снять средства, сумма которых превышает текущий баланс, должна вызывать исключение InsufficientFundsException 
// с сообщением о недостаточных средствах и текущим балансом.

// Продемонстрируйте работу вашего приложения:
// Программа должна обрабатывать все исключения с помощью конструкции try-catch, выводя соответствующие сообщения об ошибках.

// 2*.
// Создать несколько типов счетов, унаследованных от Account, например: CreditAcciunt, DebitAccount.
// Создать класс (Transaction), позволяющий проводить транзакции между счетами (переводить сумму с одного счета на другой)

// Класс Transaction должен возбуждать исключение в случае неудачной попытки перевести деньги с одного счета на другой.

// Продемонстрируйте работу вашего приложения:
// Программа должна обрабатывать все исключения с помощью конструкции try-catch, выводя соответствующие сообщения об ошибках.

public class Main {
    public static void main(String[] args) {
        try {
            // Создание счета с начальным балансом
            Account account = new Account(1000);
            
            // Депозит
            account.deposit(500);
            
            // Снятие средств
            account.withdraw(200);
            
            // Вывод текущего баланса
            System.out.println("Текущий баланс: " + account.getBalance());
            
            // Создание кредитного счета
            CreditAccount creditAccount = new CreditAccount(2000);
            
            // Перевод средств с одного счета на другой
            Transaction.transfer(account, creditAccount, 500);
            
            // Вывод текущего баланса обоих счетов
            System.out.println("Баланс счета: " + account.getBalance());
            System.out.println("Баланс кредитного счета: " + creditAccount.getBalance());
        } catch (IllegalArgumentException e) {
            System.out.println("Ошибка: " + e.getMessage());
        } catch (InsufficientFundsException e) {
            System.out.println("Ошибка: " + e.getMessage() + ", текущий баланс: " + e.getBalance());
        }
    }
}